In [21]:
import numpy as np
import pandas as pd

In [66]:
d = {
    'Name': ['Arun','Dushyant','Nishant','Mohit','Ashish','Mukul','Nandini','Akash'],
    'Age': [23,24,25,26,27,28,29,30],
    'City': ['Agra','Mathura','Aligarh','Nodia','Delhi','Lucknow','Gurgaon','Prayajraj']
}
d= pd.DataFrame(data)
print(d)

    Name  Age    City
0   Arun   25   Noida
1  Rohit   30   Delhi
2   Neha   22  Mumbai
3  Pooja   28    Pune

In [23]:
# Sample data
data = {
    'Name': ['Arun', 'Rohit', 'Neha', 'Pooja'],
    'Age': [25, 30, 22, 28],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Pune']
}

# Creating a DataFrame
df = pd.DataFrame(data)

# Display DataFrame
print(df)

    Name  Age    City
0   Arun   25   Noida
1  Rohit   30   Delhi
2   Neha   22  Mumbai
3  Pooja   28    Pune

In [31]:
print(df.shape)   # Rows & Columns ka size batata hai
print(df.columns) # Column ke names batata hai
print(df.dtypes)  # Column ka data type batata hai
print(df.info())  # Complete summary deta hai
print(df.describe()) # Numerical columns ka statistics deta hai

(4, 3)
Index(['Name', 'Age', 'City'], dtype='object')
Name    object
Age      int64
City    object
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None
         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

In [57]:
print(d.shape)

(8, 3)

In [59]:
print(df.columns)

Index(['name', 'age', 'city'], dtype='object')

In [43]:
print(df.dtypes)

name    object
age      int64
city    object
dtype: object

In [47]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   age     8 non-null      int64
 2   city    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes
None

In [51]:
print(df.describe())

            age
count   8.00000
mean   26.50000
std     2.44949
min    23.00000
25%    24.75000
50%    26.50000
75%    28.25000
max    30.00000

In [69]:
print(df.iloc[2])   # 2nd row ko access karna (index 1)

name    nishant
age          25
city    aligarh
Name: 2, dtype: object

In [67]:
print(df.iloc[1:4]) # 2nd aur 3rd row ko access karna

       name  age     city
1  dushyant   24  mathura
2   nishant   25  aligarh
3     mohit   26    nodia

Data Manipulation
(a) Naye column add karna

In [74]:
df['salary']=[6500,7500,8500,9500,10500,11500,12500,13500]
print(df)

       name  age       city  salary
0      arun   23       agra    6500
1  dushyant   24    mathura    7500
2   nishant   25    aligarh    8500
3     mohit   26      nodia    9500
4    ashish   27      delhi   10500
5     mukul   28    lucknow   11500
6   nandini   29    gurgaon   12500
7     akash   30  prayajraj   13500

In [76]:
df.isnull()

    name    age   city  salary
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False
6  False  False  False   False
7  False  False  False   False

In [80]:
df['Contact']=[99999999,525762532,852037426,163573592,1283665373,3421886895,8006053914,164676567]
print(df)

       name  age       city  salary     Contact
0      arun   23       agra    6500    99999999
1  dushyant   24    mathura    7500   525762532
2   nishant   25    aligarh    8500   852037426
3     mohit   26      nodia    9500   163573592
4    ashish   27      delhi   10500  1283665373
5     mukul   28    lucknow   11500  3421886895
6   nandini   29    gurgaon   12500  8006053914
7     akash   30  prayajraj   13500   164676567

In [1]:
import numpy as np
import pandas as pd

In [64]:
df.head(4)

    Name  Age    City
0   Arun   25   Noida
1  Rohit   30   Delhi
2   Neha   22  Mumbai
3  Pooja   28    Pune